import time
import os
import random


def clear():  # очистка консоли
    os.system('cls' if os.name == 'nt' else 'clear')


def coin_game():  # функция для подбрасывания монеты(орел, решка)
    result = random.choice([1, 2])

    while True:  # цикл с выбором рла или решки
        clear()
        print("╔═══════════════════════════════════════════════════════════╗")
        print("║              ВЫБИРАЙТЕ! ОРЁЛ ИЛИ РЕШКА?                   ║")
        print("╚═══════════════════════════════════════════════════════════╝")
        print()
        print("1. Орёл")
        print("2. Решка")
        print()

        player_choice = input()  # Ввод игрока

        if player_choice == '1' or player_choice == '2':  # Прверка на корректный ввод игрока
            player_num = int(player_choice)  # преобразование в int

            if player_num == result:  # Если игрок угадал возвращает True
                clear()
                print("╔═══════════════════════════════════════════════════════════╗")
                print("║                     ВЫ УГАДАЛИ                            ║")
                print("╚═══════════════════════════════════════════════════════════╝")
                time.sleep(1.5)
                clear()
                return True
            else:  # Если игрок не угадал возвращает False
                clear()
                print("╔═══════════════════════════════════════════════════════════╗")
                print("║                     ВЫ НЕ УГАДАЛИ                         ║")
                print("╚═══════════════════════════════════════════════════════════╝")
                time.sleep(1.5)
                clear()
                return False
        else:  # сли игрок дал некорректный ввод
            clear()
            print("╔═══════════════════════════════════════════════════════════╗")
            print("║                   ТАКОГО ОТВЕТА НЕТ                       ║")
            print("╚═══════════════════════════════════════════════════════════╝")
            time.sleep(1.5)
