
import time
import os
import random

def clear():  # очистка консоли от предыдущего ввода
    os.system('cls' if os.name == 'nt' else 'clear')

def start():
    """Функция запуска мини-игры. Возвращает количество собранных шприцев."""
    clear()  # Очищаем экран и показываем приветственное сообщение(правила игры)
    print("╔═══════════════════════════════════════════════════════════╗")
    print("║                    МИНИ-ИГРА НАЧАЛАСЬ                     ║")
    print("║         Соберите все шприцы (💉) и найдите выход (🚪)     ║")
    print("║         Управление: W, A, S, D + Enter                    ║")
    print("╚═══════════════════════════════════════════════════════════╝")
    time.sleep(2)
    # определение игровых объектов
    PLAYER = '🎩'  # Игрок
    WALL = '⬛'  # Стена
    SURINGE = '💉'  # Шприц
    FREE = '⬜'  # Свободная клетка
    DOOR = '🚪'  # Дверь (выход из игры)
    # первая карта
    game_map1 = [
        ['⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '💉', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬛', '⬛', '⬛', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '💉', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '💉', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬜', '⬜', '💉', '⬛', '⬛', '⬛', '⬜', '⬜', '⬛'],
        ['🚪', '🎩', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '💉', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '💉', '⬛', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '💉', '⬜', '⬜', '⬜', '⬜', '💉', '⬛', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛'],
        ['⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛'],
    ]
    # вторая карта
    game_map2 = [
        ['⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '💉', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛', '⬜', '⬜', '💉', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '💉', '⬜', '⬛', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬜', '⬜', '⬛', '⬛', '⬛', '⬜', '⬜', '⬛', '⬛'],
        ['🚪', '🎩', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬜', '⬜', '⬛', '⬛', '⬛', '⬜', '⬜', '⬛', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '💉', '⬛', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛', '⬜', '💉', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '💉', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛'],
    ]
    # третья карта
    game_map3 = [
        ['⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '💉', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '💉', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '💉', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬛', '⬛', '⬛', '⬜', '⬛', '⬛', '⬛', '⬜', '⬛', '⬛', '⬛', '⬛', '⬜', '⬛'],
        ['🚪', '🎩', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬛', '⬛', '⬛', '⬛', '⬜', '⬛', '⬛', '⬛', '⬜', '⬛', '⬛', '⬛', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '💉', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '💉', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '💉', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬜', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬛', '⬜', '⬜', '⬜', '⬜', '⬛'],
        ['⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛', '⬛'],
    ]

    game_map = [row[:] for row in random.choice([game_map1, game_map2, game_map3])]  # случайный выбор из трех карт

    player_x, player_y = 0, 0  # Находим начальную позицию игрока
    for y, row in enumerate(game_map):
        for x, item in enumerate(row):
            if item == PLAYER:
                player_x = x
                player_y = y
                break

    score = 0  # счетчик шприцев, которые собрал игрок
    game_running = True

    while game_running:
        clear()  # очищаем экран
        for row in game_map:  # отрисовка карты
            print(''.join(row))
        print(f'\nСчёт (собрано шприцев): {score}')  # статистика(количество шприцев)
        print('Управление: W, A, S, D + Enter (Q - выход)')  # управление

        move = input().lower()  # gолучаем команду от игрока и приводим к нижнему регистру

        if move == 'q':  # выход из игры
            break

        new_x, new_y = player_x, player_y  # новые координаты по движению игрока

        if move == 'w':  # Вверх
            new_y -= 1
        elif move == 's':  # Вниз
            new_y += 1
        elif move == 'a':  # Влево
            new_x -= 1
        elif move == 'd':  # Вправо
            new_x += 1
        else:
            continue  # если нажата неверная клавиша - пропускаем ход
        # Проверяем, не вышел ли за границы карты
        if new_y < 0 or new_y >= len(game_map) or new_x < 0 or new_x >= len(game_map[0]):
            continue  # Если вышел за границы - не двигаемся

        target_item = game_map[new_y][new_x]  # Смотрим, что находится в целевой клетке

        if target_item == WALL:  # если целевая клетка - это стена, не двигаемся
            continue

        if target_item == DOOR:  # если целевая клетка - это дверь, то игрок выигрывает и выходит из игры
            game_running = False
            break

        if target_item == SURINGE:  # если целевая клетка - это шприц, то цвеличиваем на 1 счетчик шприцев
            score += 1
        # перемещение игрока
        game_map[player_y][player_x] = FREE  # очистка старой позиции
        game_map[new_y][new_x] = PLAYER  # ставим игрока в новую позицию
        player_x, player_y = new_x, new_y  # обновление координатов игрока

    clear()  # конец игры
    print("╔═══════════════════════════════════════════════════════════╗")
    print(f"║         МИНИ-ИГРА ЗАВЕРШЕНА! Собрано шприцев: {score}           ║")
    print("╚═══════════════════════════════════════════════════════════╝")
    time.sleep(2)

    return score  # возвращаем количество собранных шприцев

if __name__ == "__main__":
    start()